InformationRegisters/ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СобственникиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СобственникиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетчикиВводов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиВводов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСЭлектросетью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСЭлектросетью</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Счетчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Счетчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЭлектроУчет/Ext/Module.bsl
Функция ТарифНаДату(Тариф, Момент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныТарифовСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныТарифов.СрезПоследних(&Момент, Тариф = &Тариф) КАК ЦеныТарифовСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Цена, 0);	
	
КонецФункции  

Функция СобственникБоксаНаДату(Бокс, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СобственникиБоксовСрезПоследних.Собственник КАК Собственник
	|ИЗ
	|	РегистрСведений.СобственникиБоксов.СрезПоследних(&Момент, Бокс = &Бокс) КАК СобственникиБоксовСрезПоследних";
	
	Запрос.УстановитьПараметр("Бокс", Бокс);
	Запрос.УстановитьПараметр("Момент", Момент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	//Пока Выборка.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	Возврат ?(Выборка.Следующий(), Выборка.Собственник, Справочники.Владельцы.ПустаяСсылка());
	
КонецФункции 

Функция СчетчикБоксаНаДату(Бокс, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетчикиБоксовСрезПоследних.Счетчик КАК Счетчик
	|ИЗ
	|	РегистрСведений.СчетчикиБоксов.СрезПоследних(&Момент, Бокс = &Бокс) КАК СчетчикиБоксовСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетчикиБоксовСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Бокс", Бокс);
	Запрос.УстановитьПараметр("Момент", Момент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Счетчик, Справочники.Счетчики.ПустаяСсылка());
КонецФункции  

Функция БоксСчетчикаНаДату(Счетчик, Момент) Экспорт
	//Счетчик - ресурс, поэтому отбор после среза, а не в его параметрах
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетчикиБоксовСрезПоследних.Бокс КАК Бокс
	|ИЗ
	|	РегистрСведений.СчетчикиБоксов.СрезПоследних(&Момент, ) КАК СчетчикиБоксовСрезПоследних
	|ГДЕ
	|	СчетчикиБоксовСрезПоследних.Счетчик = &Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетчикиБоксовСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Бокс, Справочники.ГаражныеБоксы.ПустаяСсылка()); 
КонецФункции 

Функция ТекущееПоказаниеЧисло(Счетчик, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущиеПоказанияСрезПоследних.Показание КАК Показание
	|ИЗ
	|	РегистрСведений.ТекущиеПоказания.СрезПоследних(&Момент, Счетчик = &Счетчик) КАК ТекущиеПоказанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Показание, 0);
КонецФункции  

//Есть ли записи показаний по счетчику строго позже момента.
//Записи самого документа (период = Дата документа) не попадают -
//поэтому корректно работает и при перепроведении.
Функция ЕстьПоказанияПосле(Счетчик, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 
	|	ТекущиеПоказания.Период Как Период
	|ИЗ
	|	РегистрСведений.ТекущиеПоказания КАК ТекущиеПоказания
	|ГДЕ
	|	ТекущиеПоказания.Счетчик = &Счетчик
	|	И ТекущиеПоказания.Период > &Момент";
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

// Есть ли по боксу другие записи установки счетчика на дату.
Функция ЕстьОперацииСБоксомВДату(Бокс, ДатаДок, ТекущийДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.СчетчикиБоксов КАК СчетчикиБоксов
	|ГДЕ
	|	СчетчикиБоксов.Период = &Дата
	|	И СчетчикиБоксов.Бокс = &Бокс
	|	И СчетчикиБоксов.Регистратор <> &ТекДок";
	Запрос.УстановитьПараметр("Бокс", Бокс);
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ТекДок", ТекущийДокумент);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

//Есть ли по вводу другие записи установки общего счетчика на дату.
Функция ЕстьОперацииСВводомВДату(Ввод, ДатаДок, ТекущийДокумент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.СчетчикиВводов КАК СчетчикиВводов
	|ГДЕ
	|	СчетчикиВводов.Период = &Дата
	|	И СчетчикиВводов.Ввод = &Ввод
	|	И СчетчикиВводов.Регистратор <> &ТекДок";
	Запрос.УстановитьПараметр("Ввод", Ввод);
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("ТекДок", ТекущийДокумент);
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

// Единый расчёт потребления для форм и проведений.
Функция ДельтаПоказаний(Счетчик, Предыдущее, Текущее) Экспорт
	Результат = Новый Структура("Дельта, Успех, Сообщение", 0, Истина, "");
	Если Текущее < Предыдущее Тогда
		Результат.Успех = Ложь;
		Результат.Сообщение = "Текущее показание (" + Текущее + ") меньше предыдущего ("
		+ Предыдущее + "). Электронный счётчик не обнуляется — проверьте ввод"
		+ " или оформите замену счётчика.";
	Иначе
		Результат.Дельта = Текущее - Предыдущее;
		Кт = ?(Счетчик.КоэффициентТрансформации = 0, 1, Счетчик.КоэффициентТрансформации);
		Результат.Дельта = Результат.Дельта * Кт;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ЗадолженностьБоксаНаДату(Бокс, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВзаиморасчетыОстатки.СуммаОстаток) КАК Долг
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Момент, Бокс = &Бокс) КАК ВзаиморасчетыОстатки";
	Запрос.УстановитьПараметр("Бокс", Бокс);
	Запрос.УстановитьПараметр("Момент", Момент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Долг, 0);
КонецФункции 

Функция ДолгСетиПоВводу(Ввод, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(РасчетыСЭлектросетьюОстатки.СуммаОстаток) КАК Долг
	|ИЗ
	|	РегистрНакопления.РасчетыСЭлектросетью.Остатки(&Момент, Ввод = &Ввод) КАК РасчетыСЭлектросетьюОстатки";
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Ввод", Ввод);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Долг, 0);
КонецФункции

Функция ВводСчетчикаНаДату(Счетчик, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Установки.Ввод КАК Ввод
	|ИЗ
	|	РегистрСведений.СчетчикиВводов.СрезПоследних(&Момент, ) КАК Установки
	|ГДЕ
	|	Установки.Счетчик = &Счетчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Установки.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ввод, Справочники.ВводыЭлектроснабжения.ПустаяСсылка());
КонецФункции 

// Счётчик числится установленным на момент:
// индивидуальный — на боксе, общий — на вводе.
Функция СчетчикВЭксплуатации(Счетчик, Момент) Экспорт
	Если Счетчик.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Счетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета Тогда
		Возврат Не ВводСчетчикаНаДату(Счетчик, Момент).Пустая();
	КонецЕсли;
	Возврат Не БоксСчетчикаНаДату(Счетчик, Момент).Пустая();
КонецФункции 

// Дата текущей установки ('00010101' - не установлен / снят).
Функция ДатаТекущейУстановки(Счетчик) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Установки.Период КАК Период
	|ИЗ
	|	РегистрСведений.СчетчикиБоксов.СрезПоследних КАК Установки
	|ГДЕ
	|	Установки.Счетчик = &Счетчик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Установки.Период
	|ИЗ
	|	РегистрСведений.СчетчикиВводов.СрезПоследних КАК Установки
	|ГДЕ
	|	Установки.Счетчик = &Счетчик";
	
	Запрос.УстановитьПараметр("Счетчик", Счетчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Период, '00010101');
КонецФункции

// Какой счётчик числится на вводе на момент времени.
Функция СчетчикВводаНаДату(Ввод, Момент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Установки.Счетчик КАК Счетчик
	|ИЗ
	|	РегистрСведений.СчетчикиВводов.СрезПоследних(&Момент, Ввод = &Ввод) КАК Установки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Установки.Период УБЫВ";
	Запрос.УстановитьПараметр("Ввод", Ввод);
	Запрос.УстановитьПараметр("Момент", Момент);	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Счетчик, Справочники.Счетчики.ПустаяСсылка());	
КонецФункции

// Состояния счётчиков на момент: где стоят и последнее показание.
//Возвращает Соответствие: Счетчик -> Структура("Бокс, ВводУстановки, Ввод, Показание").
// У неустановленного - пустые Бокс и Ввод, показание 0.
Функция СостоянияСчетчиков(Счетчики, Момент) Экспорт
Результат = Новый Соответствие;
Если Счетчики.Количество() = 0 Тогда
	Возврат Результат; // с пустым списком
КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Счетчики.Ссылка КАК Счетчик,
		|	ЕСТЬNULL(ТекущиеПоказанияСрезПоследних.Показание, 0) КАК Показание,
		|	ЕСТЬNULL(СчетчикиБоксовСрезПоследних.Бокс, ЗНАЧЕНИЕ(Справочник.ГаражныеБоксы.ПустаяСсылка)) КАК Бокс,
		|	ЕСТЬNULL(СчетчикиВводовСрезПоследних.Ввод, ЗНАЧЕНИЕ(Справочник.ВводыЭлектроснабжения.ПустаяСсылка)) КАК ВводУстановки,
		|   ЕСТЬNULL(СчетчикиБоксовСрезПоследних.Бокс.Ввод, ЕСТЬNULL( СчетчикиВводовСрезПоследних.Ввод,ЗНАЧЕНИЕ(Справочник.ВводыЭлектроснабжения.ПустаяСсылка))) КАК Ввод
		|ИЗ
		|	Справочник.Счетчики КАК Счетчики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеПоказания.СрезПоследних(&Момент, ) КАК ТекущиеПоказанияСрезПоследних
		|		ПО ТекущиеПоказанияСрезПоследних.Счетчик = Счетчики.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетчикиБоксов.СрезПоследних(&Момент, ) КАК СчетчикиБоксовСрезПоследних
		|		ПО СчетчикиБоксовСрезПоследних.Счетчик = Счетчики.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетчикиВводов.СрезПоследних(&Момент, ) КАК СчетчикиВводовСрезПоследних
		|		ПО СчетчикиВводовСрезПоследних.Счетчик = Счетчики.Ссылка
		|ГДЕ
		|	Счетчики.Ссылка В (&Счетчики)";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Счетчики", Счетчики);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Счетчик, Новый Структура("Бокс, ВводУстановки, Ввод, Показание", Выборка.Бокс, Выборка.ВводУстановки, Выборка.Ввод, Выборка.Показание));
	КонецЦикла;
	Возврат Результат;
КонецФункции
